-- фио, факультет, уровень бм, курс, признак (не отчисл), количество долгов, 2 курс дата

SELECT
    CONCAT_WS(' ', "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО") AS "ФИО студента",
    "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ" AS "Факультет",
    "Н_УЧЕНИКИ"."ПРИЗНАК" AS "Признак студента",
    "Н_ПЛАНЫ"."КУРС" AS "Курс",
    DATE_TRUNC('year', "Н_УЧЕНИКИ"."НАЧАЛО") + INTERVAL '2 years' AS "Дата начала 2 курса",

  COUNT(CASE WHEN "Н_ВЕДОМОСТИ"."ОЦЕНКА" = 'незач' OR "Н_ВЕДОМОСТИ"."ОЦЕНКА" = '2' THEN 1 END) AS "Количество долгов",
  CASE WHEN "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Бакалавр%' THEN 'Бакалавр'
       WHEN "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Магистр%' THEN 'Магистр'
  END AS "Бакалавр или магистр"
FROM "Н_ЛЮДИ"
JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
JOIN "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" ON "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
JOIN "Н_КВАЛИФИКАЦИИ" ON "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."КВАЛ_ИД" = "Н_КВАЛИФИКАЦИИ"."ИД"
WHERE EXISTS(SELECT 1 FROM "Н_ВЕДОМОСТИ" WHERE "Н_УЧЕНИКИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" AND ("Н_ВЕДОМОСТИ"."ОЦЕНКА" = 'незач' OR "Н_ВЕДОМОСТИ"."ОЦЕНКА" = '2'))
AND ("Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Бакалавр%' OR "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Магистр%' )
AND ("Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен' OR "Н_УЧЕНИКИ"."ПРИЗНАК" = 'академ')

GROUP BY
  CONCAT_WS(' ', "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО"),
  "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ",
  "Н_УЧЕНИКИ"."ПРИЗНАК",
  "Н_ПЛАНЫ"."КУРС",
  "Н_УЧЕНИКИ"."НАЧАЛО",
  CASE WHEN "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Бакалавр%' THEN 'Бакалавр'
       WHEN "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Магистр%' THEN 'Магистр'
  END;


EXPLAIN ANALYSE SELECT
    CONCAT_WS(' ', "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО") AS "ФИО студента",
    "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ" AS "Факультет",
    "Н_УЧЕНИКИ"."ПРИЗНАК" AS "Признак студента",
    "Н_ПЛАНЫ"."КУРС" AS "Курс",
    DATE_TRUNC('year', "Н_УЧЕНИКИ"."НАЧАЛО") + INTERVAL '2 years' AS "Дата начала 2 курса",

  COUNT(CASE WHEN "Н_ВЕДОМОСТИ"."ОЦЕНКА" = 'незач' OR "Н_ВЕДОМОСТИ"."ОЦЕНКА" = '2' THEN 1 END) AS "Количество долгов",
  CASE WHEN "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Бакалавр%' THEN 'Бакалавр'
       WHEN "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Магистр%' THEN 'Магистр'
  END AS "Бакалавр или магистр"
FROM "Н_ЛЮДИ"
JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
JOIN "Н_ОТДЕЛЫ" ON "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД"
JOIN "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" ON "Н_ПЛАНЫ"."НАПС_ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
JOIN "Н_КВАЛИФИКАЦИИ" ON "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."КВАЛ_ИД" = "Н_КВАЛИФИКАЦИИ"."ИД"
WHERE EXISTS(SELECT 1 FROM "Н_ВЕДОМОСТИ" WHERE "Н_УЧЕНИКИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" AND ("Н_ВЕДОМОСТИ"."ОЦЕНКА" = 'незач' OR "Н_ВЕДОМОСТИ"."ОЦЕНКА" = '2'))
AND ("Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Бакалавр%' OR "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Магистр%' )
AND ("Н_УЧЕНИКИ"."ПРИЗНАК" = 'обучен' OR "Н_УЧЕНИКИ"."ПРИЗНАК" = 'академ')

GROUP BY
  CONCAT_WS(' ', "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО"),
  "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ",
  "Н_УЧЕНИКИ"."ПРИЗНАК",
  "Н_ПЛАНЫ"."КУРС",
  "Н_УЧЕНИКИ"."НАЧАЛО",
  CASE WHEN "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Бакалавр%' THEN 'Бакалавр'
       WHEN "Н_КВАЛИФИКАЦИИ"."НАИМЕНОВАНИЕ" LIKE 'Магистр%' THEN 'Магистр'
  END;
