from random import randint

numbers = []
second = []
names = ['Павел', 'Александра', 'Алексей', 'Алла', 'Анастасия', 'Анатолий', 'Андрей', 'Анна', 'Антон', 'Артём', 'Александер', 'Валентина', 'Валерий', 'Виктор', 'Виктория', 'Владимир', 'Галина', 'Даниил', 'Дарья', 'Денис', 'Дмитрий', 'Евгений', 'Евгения', 'Екатерина', 'Елена', 'Иван', 'Игорь', 'Илья', 'Инна', 'Ирина', 'Константин', 'Людмила', 'Максим', 'Марина', 'Мария', 'Михаил', 'Надежда', 'Наталья', 'Николай', 'Оксана', 'Олег', 'Ольга', 'Вадим', 'Полина', 'Роман', 'Светлана', 'Сергей', 'Татьяна', 'Юлия', 'Юрий']
alfa = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К']
alfz = ['Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Э', 'Ю', 'Я']

num = int(input('Введите число: '))
for i in range(50):
    numbers.append(randint(1, 50))
for i in range(50):
    if numbers[i] > num:
        second.append('High')
    else:
        second.append('Low')

namea = [name for name in names if (name[0] in alfa)]
namez = [name for name in names if (name[0] in alfz)]
print(numbers)
print('Список с High и Low:', second)
print('Список с именами до K:', namea)
print('Список с именами после K:', namez)