'''
Создайте программу для запроса имени пользователя.
	- В режиме интерпретатора, запросите имя и фамилию у пользователя, сохраните их в виде переменных и выведите на
    экран в формате ‘Привет, Имя Фамилия!’;
	- Сохраните эту программу в виде файла ‘Hello.py’, добейтесь ее выполнения в режиме командной строки.
'''

name = input ("Введите имя и фамилию: ")
print ("Привет, " + name + "!")
